# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# Stage 4 RGB-IR small-object OBB configuration.
# This is an explicit opt-in high-resolution variant that adds a P2 detection branch while keeping deployment RGB-only.
# Stage 4 still does not consume img_prev; temporal support remains disabled until Stage 5.

# Parameters
nc: 80
use_rgbir_train_assist: true
use_temporal: false
temporal_mode: "off"
fusion_type: "gated_add"
ir_branch_width: 0.25
ir_feature_stages: [6, 9]
rgbir_aux_loss_weight: 0.05
rgbir_residual_scale: 0.10
small_object_mode: "p2"
ir_train_only: true
train_assist_eval_bypass: true
use_small_object_sampling: true
use_small_object_loss_weighting: false
enable_small_object_metrics: true
small_object_area_thr_norm: 0.005
small_object_sampling_power: 1.0
small_object_sampling_min_weight: 1.0
small_object_sampling_max_weight: 3.0
small_object_loss_gain: 0.25
small_object_loss_on: [box, cls, dfl, angle]
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, true]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, true]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, true]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, true]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [null, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [null, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 15 (P3/8)

  - [-1, 1, nn.Upsample, [null, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]] # 18 (P2/4)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 21 (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 24 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]] # 27 (P5/32)

  - [[18, 21, 24, 27], 1, OBB, [nc, 1]]
